#include<iostream>
using namespace std;
int main()
{
    int n;
    cin >> n;
    int a[n]; // n гишүүнтэй хүснэгт үүсгэсэн
    for(int i=0; i<n; i++)
    {
        cin >> a[i];   // Гараас n тоогоо авж байна
    }
    int temp;   // түр зуурын хувьсагч энд утгуудаа хадгална
    for(int i=0; i<n; i++) 
    {
        for(int j=0; j<i; j++)
        {
            if(a[i] < a[j]) // өсөхөөр эрэмбэлж байна.(буурахаар эрэмблэхээр бол их багын тэмдгийг солино)
            {
                temp = a[i];   // temp-дээ a[i]- ийн утгыг хадгална
                a[i] = a[j];   // a[i]-д a[j]-н утгыг өгснөөр a[i], a[j] адилхан утгатай болсон байна.
                a[j] = temp;   // a[j]-д temp - д хадгалж өгсөн a[i]-ийн утгыг өгнө
            }
        }
    }
    for(int i=0; i<n; i++)
    {
        cout << a[i] << " ";
    }
}